In [1]:
import numpy as np
import pandas as pd

df = pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a'],
                  'key2':['one', 'two', 'one', 'two', 'one'],
                  'data1': np.random.randn(5),
                  'data2':np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one -0.645934 -0.121771
1    a  two -1.582683 -0.484511
2    b  one  0.359712 -0.494060
3    b  two -0.996521 -1.008909
4    a  one  0.327774  1.658960

In [3]:
#set_index()
df=df.set_index('key1')
df

     key2     data1     data2
key1
a     one -0.645934 -0.121771
a     two -1.582683 -0.484511
b     one  0.359712 -0.494060
b     two -0.996521 -1.008909
a     one  0.327774  1.658960

In [4]:
df.loc['a']

     key2     data1     data2
key1
a     one -0.645934 -0.121771
a     two -1.582683 -0.484511
a     one  0.327774  1.658960

In [5]:
df = pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a'],
                  'key2':['one', 'two', 'one', 'two', 'one'],
                  'data1': np.random.randn(5),
                  'data2':np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one  1.071441  0.811186
1    a  two  1.220482  0.003284
2    b  one -2.025901 -0.804329
3    b  two  0.741570 -1.227547
4    a  one -0.623485  0.084143

In [6]:
groupby1 = df.groupby('key1')
groupby1

In [7]:
#一個一個讀取groupby物件內的值
#使用for in
for key,values in groupby1:
    print(key)
    print(values)

a
  key1 key2     data1     data2
0    a  one  1.071441  0.811186
1    a  two  1.220482  0.003284
4    a  one -0.623485  0.084143
b
  key1 key2     data1     data2
2    b  one -2.025901 -0.804329
3    b  two  0.741570 -1.227547

In [10]:
allDict=dict(list(groupby1))

In [11]:
allDict['a']

  key1 key2     data1     data2
0    a  one  1.071441  0.811186
1    a  two  1.220482  0.003284
4    a  one -0.623485  0.084143

In [12]:
allDict['b']

  key1 key2     data1     data2
2    b  one -2.025901 -0.804329
3    b  two  0.741570 -1.227547